_posts/2023-10-04-stack-ranking-and-decimation.html
---
layout: post
title: Stack ranking and decimation
excerpt: Job cuts rarely impact power structures as they're supposed to
---

<p>
Earlier this year, Blizzard's World of Warcraft Classic development lead Brian Birmingham was <a href="https://www.ign.com/articles/former-blizzard-manager-opens-up-about-being-fired-for-protesting-ranking-system">terminated</a> over protesting the practice of <a href="https://lattice.com/library/what-is-stack-ranking-and-why-is-it-a-problem">stack ranking</a>. Stack ranking, <a href="https://www.wsj.com/articles/SB10001424052702303789604579198281053673534">pioneered</a> by legendary GE CEO Jack Welch, involves grading all employees on a bell curve, with a small number of employees&#x2013;usually between 5 and 15 percent&#x2013;always marked as "needing improvement". Being ranked on the lower end of the bell curve, of course, has implications for compensation and career development.
</p>

<div id="outline-container-org38afd8b" class="outline-2">
<h2 id="org38afd8b">The fairness of the curve</h2>
<div class="outline-text-2" id="text-org38afd8b">
<blockquote>
<p>
Yes, I realize that some believe the bell-curve aspect of differentiation is "cruel." That always strikes me as odd. We grade children in school, often as young as 9 or 10, and no one calls that cruel. But somehow adults can't take it? Explain that one to me.
</p>
</blockquote>

<p>
Being graded on a curve should be familiar to anyone who's gone though an American high school, and I do not recall any objection to the practice during my time as a student. Why, then, is it a matter of controversy in the corporate world?
</p>

<p>
The most obvious issue is that a lot more is at stake for adults. Aside from pay and promotion, reviews are a major criterion for layoffs. While a bad grade is unpleasant, it hardly has the life-altering impact of a pink slip. The analogy with school may be more apt if being graded on the low end of a curve carried with it a risk of expulsion. Were this case, students and parents would surely be up in arms.
</p>

<p>
School is also a far more artificial environment than work, and this artificiality allows for a certain impression of "fairness". All students in a class are subject to the same assignments and exams, so the argument is often made that everyone is on an even playing field. That students have wildly different resources outside the classroom is a fact which most dismiss.
</p>

<p>
What's harder to ignore, however, is that a corporate environment, although artificial in its own way, has no pretense of fairness. Individual's tasks and team's projects differ, so that evaluations are far more subjective. Furthermore, while teachers are expected to treat all students equally, managers are under no such obligation. Line managers and their reports are, in some sense, peers, and reviews are as likely to be a reflection of personal rapport as they are of work outcomes.
</p>

<p>
Welch claims that "differentiation"&#x2013;his preferred term for stack ranking&#x2013;produces "consistency, transparency, and candor". None of these attributes, however, is inherently linked to grading on a curve; nor is any of them the inevitable result of doing so. Birmingham exercised candor in saying how he felt no one on his team needed to be classified as not meeting expectations. The company swiftly&#x2013;and non-transparently&#x2013;terminated him.
</p>
</div>
</div>

<div id="outline-container-org3d07d82" class="outline-2">
<h2 id="org3d07d82">Theory, practice, and constraints</h2>
<div class="outline-text-2" id="text-org3d07d82">
<p>
A number of major companies, such as <a href="https://www.shrm.org/resourcesandtools/hr-topics/compensation/pages/stack-ranking-microsoft.aspx">Microsoft</a>, have tried and abandoned stack ranking. But does the practice of marking a certain proportion of employees as underperformers&#x2013;with an eye towards eventually getting rid of them&#x2013;have no merit? After all, not every hiring choice will be correct, and hardly anyone can disagree that organizations&#x2013;especially large ones&#x2013;carry dead weight. And if a company runs into difficulty, surely laying off the poorly reviewed employees first is the way to go?
</p>

<p>
Here is where it's important to differentiate between theory and practice. In theory, purging a company of its bottom 10% performers raises the average performance&#x2013;this is merely arithmetic, the result of reducing the weaker parts of the organization and growing its stronger components.
</p>

<p>
In practice&#x2013;as seen at Blizzard, Microsoft, and elsewhere&#x2013;cuts are subject to the political constraints of the org tree, with the quota being passed recursively downward until it reaches the line manager. The result is punishment inflicted evenly to all teams alike, thereby failing to effect any "differentiation" at all. Teams that do well&#x2013;such as <a href="https://www.gamespot.com/articles/wow-classics-success-surprised-blizzard-dev-thought-it-would-only-appeal-to-core-fans/1100-6487853/https://www.gamespot.com/articles/wow-classics-success-surprised-blizzard-dev-thought-it-would-only-appeal-to-core-fans/1100-6487853/">WoW Classic</a>&#x2013;feel they are being punished targeted despite being successful, while teams that do poorly lose only a smattering of personnel&#x2013;the same proportion as good teams, no less&#x2013;and are thus under no pressure to change. Rather than alter the company's structure, which should be the goal, stack ranking as practiced by most organizations instead reinforces it.
</p>

<p>
This induces perverse outcomes, such as making team members jostle with each other instead of other teams or companies. The reason is simple&#x2013;they're being graded against other team members, so that's who their competitors are. Welch's claim that "if you want teamwork, you identify it as a value" conveniently glosses over how such "identified values" should be incentivized. Absent any compensating factor, individuals quickly find that the best way to game the system is to reduce risk taking, join weaker teams, and sabotage their peers. Welch would no doubt protest that these are not the "correct" implementations of his strategy, but the ease with which a strategy can be correctly implemented is a metric by which it must be evaluated. Otherwise, Communism should receive full marks merely for the perfection of its utopian ideals.
</p>
</div>
</div>

<div id="outline-container-org8c31d35" class="outline-2">
<h2 id="org8c31d35">What have the Romans done for us?</h2>
<div class="outline-text-2" id="text-org8c31d35">
<p>
There is another argument in favor of stack ranking&#x2013;particular the "rank and yank" version that Welch himself abhors&#x2013;which is that periodic cuts keep employees on their toes and prevent them from getting too comfortable (i.e. lazy) with their jobs.
</p>

<p>
One commonly cited example is Facebook (Meta), which had virtually uninterrupted headcount growth from its founding in 2004 to <a href="https://www.cbsnews.com/sanfrancisco/news/facebook-parent-meta-plans-to-lay-off-another-10000-employees/">late 2022</a>, and has long had a reputation for keeping people around who did little, had <a href="https://fortune.com/2023/03/16/meta-hoarded-us-like-pokemon-cards-former-staffer-fight-for-work-mark-zuckerberg/">little to do</a>, or both&#x2013;a place where one could be paid good money to "<a href="https://www.insider.com/rest-and-vest-millionaire-engineers-who-barely-work-silicon-valley-2017-7">rest and vest</a>". Since the recent waves of job cuts, the story goes, Facebook has gotten serious, dumped less money on <a href="https://www.cnbc.com/2023/02/01/meta-lost-13point7-billion-on-reality-labs-in-2022-after-metaverse-pivot.html">losing initiatives</a> like the metaverse, and <a href="https://www.nytimes.com/2023/07/26/technology/meta-earnings-second-quarter.html">refocused on profits</a>.
</p>

<p>
That the stick should accompany the carrot is hardly a new idea. The Romans had the practice of <i>decimatio</i>, whereby a military unit accused of major failings would have <a href="https://en.wikipedia.org/wiki/Decimation_(punishment)">every man in ten killed</a>. The 10% figure is, coincidentally or not, close to what stack ranking typically uses. There are some important distinctions between the intentions of decimation and stack ranking, however, that are worth considering the context of a "punishment is good and necessary" narrative.
</p>

<p>
First of all, decimation was not a regular occurrence. It was utilized only in extreme cases where units exhibited unforgivable behavior such as cowardice, not merely for losing a battle. And it was usually applied to small groups of men (no larger than a cohort) who were viewed as directly responsible for each other. That's why a key attribute of decimation was that the 10% had to be killed by their fellow solders&#x2013;the point was to ensure the death of one man had psychological impact on the other nine, shaming them for their collective failure. It's also why the men marked for death were chosen not for individual performance but randomly, so that the remainder would suffer survivor's guilt knowing that they were equally responsible for the outcome.
</p>

<p>
Decimation also became increasingly rare as the Roman army professionalized. During the early to mid republic, legions were raised from the citizenry when a war started. This meant that armies were often ill-trained and prone to breaking under pressure, necessitating the use of decimation&#x2013;among other punishments&#x2013;as a means of ensuring that amateur citizen-soldiers were more afraid of the commanders behind than the enemy in front. With the switch to professional soldiers during the imperial period, however, such tactics were unnecessary and even counterproductive. Men who'd fought alongside each other for years would balk at the idea of killing their comrades, and generals who demanded imposed such punishments would quickly lose support.
</p>

<p>
The professionals to whom stack ranking is often applied&#x2013;software developers, investment bankers, etc.&#x2013;tend to have options and don't have to put up with "punishment". For lower-end jobs, such as warehouse work, the <a href="https://www.theverge.com/2022/10/17/23409920/amazon-third-hires-attrition-cost-workforce">churn rate is already high</a>, so regular cuts won't make much of an impact. It's not clear, then, to whom job cuts as an intimidation tactic is best applied.
</p>
</div>
</div>

<div id="outline-container-orged14a9f" class="outline-2">
<h2 id="orged14a9f">How to manage an organization</h2>
<div class="outline-text-2" id="text-orged14a9f">
<p>
What most large companies should realize is that rewarding and punishing individuals is a goal in and of itself. If the company is doing well, no one cares about carrying dead weight. If the company isn't doing well, a 10% cut won't save it.
</p>

<p>
If the goal is to allow more successful parts of the company to expand and less successful ones to shrink, top-down cuts are not a good solution. If such cuts are executed down the org tree, the result is that good teams are cut just as much as bad ones. Centralizing the decision-making of cuts rarely works out either, as high-level executives are not familiar enough with day-to-day operations to even know which teams do well and which do poorly.
</p>

<p>
A better solution, as many companies have found, is to allow parts of the company to operate autonomously. Each component manages its own personnel, finances, etc., and contracts for services with other components. The components that do well naturally attract employees from other parts of the company, in addition to having resources to hire and expand. Ones that do poorly shrink for want of resources. Aside from some high-level, company-wide guidelines, each component decides how it manages its systems of hiring, firing, promotion, and compensation, creating an ecosystem of experiments that constantly rewards success.
</p>

<p>
Welch brought GE's valuation to new heights, but the company has struggled since he left, despite his handpicked successors studiously applying his methods. And whatever stack ranking's merits may be, that it's rejected by successful individuals such as Birmingham is itself an issue, as no company can succeed long by pushing away good people. Though there's no single correct corporate management philosophy, some are clearly more successful than others&#x2013;and stack ranking is one that seems destined for the dustbin of history.
</p>
</div>
</div>
